docs/site/garnett01_aesth_inter_comput_music.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-02-21 Sat 11:04 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>garnett01_aesth_inter_comput_music</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="../style.css" type="text/css">
</head>
<body>
<div id="content" class="content">
<h1 class="title">garnett01_aesth_inter_comput_music</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org629e0a6">The Aesthetics of Interactive Computer Music</a>
<ul>
<li><a href="#org5242524">Performance Oriented Music</a></li>
<li><a href="#org31ba1ee">Aesthetic</a></li>
<li><a href="#org002fe5a">Interaction</a></li>
<li><a href="#org738dc04">Domain</a></li>
<li><a href="#org301604c">Transparency</a></li>
<li><a href="#org978d7aa">Reconnecting with past traditions</a></li>
<li><a href="#orgb43ead9">What the Human Performer Brings to Computer Music</a></li>
<li><a href="#org707e00f">Gestural Nuance</a></li>
<li><a href="#org198615b">Physical and Cognitive Constraints</a></li>
<li><a href="#org08e295c">Interpretation</a></li>
<li><a href="#org9cafc96">Change</a></li>
<li><a href="#org9aa5a47">Flexibility and survivability</a></li>
<li><a href="#org7e639a4">Modernism and Humanism</a></li>
<li><a href="#org00a53ca">Algorithmic Tape Music</a></li>
<li><a href="#org5f4fa90">Lost in tape music</a></li>
<li><a href="#orgc173f1d">De-museumize</a></li>
<li><a href="#org7c5b9ab">What the Computer Brings to Human Performance</a></li>
<li><a href="#org5888a75">Music performance as shared human endeavor</a></li>
<li><a href="#org11115b2">Uniting with the past</a></li>
<li><a href="#orga6175e9">Human vs tech</a></li>
<li><a href="#orgf8e6865">Ignore Tech</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org629e0a6" class="outline-2">
<h2 id="org629e0a6">The Aesthetics of Interactive Computer Music</h2>
<div class="outline-text-2" id="text-org629e0a6">
</div>
<div id="outline-container-org5242524" class="outline-3">
<h3 id="org5242524">Performance Oriented Music</h3>
<div class="outline-text-3" id="text-org5242524">
<p>
Interactive computer music a sub-genre of performance-oriented computer music. This genre requires at least one live performer joined with electronics.
</p>

<p>
The interactive in this article is narrowed to the performer having some kind of control over the electronics or electronics that affect the performer's sound
</p>
</div>
</div>
<div id="outline-container-org31ba1ee" class="outline-3">
<h3 id="org31ba1ee">Aesthetic</h3>
<div class="outline-text-3" id="text-org31ba1ee">
<p>
An aesthetic is the artistic valorization in a work of art.
</p>
</div>
</div>
<div id="outline-container-org002fe5a" class="outline-3">
<h3 id="org002fe5a">Interaction</h3>
<div class="outline-text-3" id="text-org002fe5a">
<p>
Either the performer affects the computer's output, or the computer affects the performer's output.
</p>
</div>
</div>
<div id="outline-container-org738dc04" class="outline-3">
<h3 id="org738dc04">Domain</h3>
<div class="outline-text-3" id="text-org738dc04">
<p>
At least requires that the performer has some control over timing, (which basically excludes things like pushing play to start a recording)
</p>
</div>
</div>
<div id="outline-container-org301604c" class="outline-3">
<h3 id="org301604c">Transparency</h3>
<div class="outline-text-3" id="text-org301604c">
<p>
As software and hardware advance one will feel less like one is working with a computer and just simply working.
</p>
</div>
</div>
<div id="outline-container-org978d7aa" class="outline-3">
<h3 id="org978d7aa">Reconnecting with past traditions</h3>
<div class="outline-text-3" id="text-org978d7aa">
<p>
This will be a theme through the article.
</p>
</div>
</div>
<div id="outline-container-orgb43ead9" class="outline-3">
<h3 id="orgb43ead9">What the Human Performer Brings to Computer Music</h3>
<div class="outline-text-3" id="text-orgb43ead9">
<p>
Inclusion of a live performer re-introduces into computer music elements that had been almost entirely removed from computer music in recent past.
</p>

<p>
One of these is the element of human performance and human cognition. Computer music has tended towards abstraction and objectivity instead of the human.
</p>
</div>
</div>
<div id="outline-container-org707e00f" class="outline-3">
<h3 id="org707e00f">Gestural Nuance</h3>
<div class="outline-text-3" id="text-org707e00f">
<p>
Rubato, subtleties of articulation and phrasing and dynamics come with the human performer. It is difficult in non interactive computer music to achieve these things. Instead the focus has been on extreme contrast gestures, or timbral development. It's not impossible to have these, but because of the difficulty to create them there is a tendency to avoid them.
</p>
</div>
</div>
<div id="outline-container-org198615b" class="outline-3">
<h3 id="org198615b">Physical and Cognitive Constraints</h3>
<div class="outline-text-3" id="text-org198615b">
<p>
Constraint that a work be performable. It means the performance gestures must be cognizable.
</p>
</div>
</div>
<div id="outline-container-org08e295c" class="outline-3">
<h3 id="org08e295c">Interpretation</h3>
<div class="outline-text-3" id="text-org08e295c">
<p>
Invariability of a human performer brings about interpretation.
</p>

<p>
Each performance is a version of the work, not the work itself
</p>
</div>
</div>
<div id="outline-container-org9cafc96" class="outline-3">
<h3 id="org9cafc96">Change</h3>
<div class="outline-text-3" id="text-org9cafc96">
<p>
This interpretation allows a work to grow and change to meet changing aesthetic values
</p>
</div>
</div>
<div id="outline-container-org9aa5a47" class="outline-3">
<h3 id="org9aa5a47">Flexibility and survivability</h3>
<div class="outline-text-3" id="text-org9aa5a47">
<p>
The flexibility of performance has perhaps allowed classical music to survive for over 250 years. 
</p>

<p>
Recordings and mass marketing start performers works against this.
</p>

<p>
The ability of interactive computer music to evolve to cultural changes is a strength not a weakness.
</p>

<p>
These come just by the nature of introducing a human performer to a work.
</p>
</div>
</div>
<div id="outline-container-org7e639a4" class="outline-3">
<h3 id="org7e639a4">Modernism and Humanism</h3>
<div class="outline-text-3" id="text-org7e639a4">
<p>
Obsession with "making it new"
Constant building systems, because it is taboo to do something someone else has already done.
</p>
</div>
</div>
<div id="outline-container-org00a53ca" class="outline-3">
<h3 id="org00a53ca">Algorithmic Tape Music</h3>
<div class="outline-text-3" id="text-org00a53ca">
<p>
Most objectivist performance. No human performer or composer conveying anything.
</p>

<p>
A bit of an ideological extreme
</p>

<p>
The counter to the extreme precision and formalism is that it tends to be further and further from what people want to endure in a concert. It does not advance knowledge, it is too simplistic to stand alone as art.
</p>

<p>
Tape music with a composer has been more successful but is still missing something.
</p>

<p>
In his opinion, the gains of new material, timbre, and modes of listening don't compensate for what is lost.
</p>
</div>
</div>
<div id="outline-container-org5f4fa90" class="outline-3">
<h3 id="org5f4fa90">Lost in tape music</h3>
<div class="outline-text-3" id="text-org5f4fa90">
<p>
Over-emphasis on precision, that precision is and end not a means to an end.
</p>

<p>
Complexity without import, detail without result
</p>

<p>
Loss of dynamic life. Even listening to the same recording of Beethoven's 9th, there is a possibility of a new performance or new recording bring life to it. Not so in electronic music
</p>

<p>
Fixed in so many ways you can't give a significant new interpretation
</p>

<p>
The ultimate museumification of art.
</p>

<p>
It is out of touch with what is needed to rejuvinate art, of being harmonious with the needs of the times
</p>

<p>
The time to objectify and formalize is past. We need a new aesthetic goal.
</p>
</div>
</div>
<div id="outline-container-orgc173f1d" class="outline-3">
<h3 id="orgc173f1d">De-museumize</h3>
<div class="outline-text-3" id="text-orgc173f1d">
<p>
It is time to popularize music again. That doesn't mean dumb it down to the banal of popular music, but to bring true artistic achievment to present culture. Otherwise we risk the death of art music.
</p>

<p>
Bringing humans into computer music can help break the paradigm of formalism	
</p>
</div>
</div>
<div id="outline-container-org7c5b9ab" class="outline-3">
<h3 id="org7c5b9ab">What the Computer Brings to Human Performance</h3>
<div class="outline-text-3" id="text-org7c5b9ab">
<p>
Computer becomes extension of performer as a "cyber performer"
</p>

<p>
It extends the performers skills that they already have to create a whole new instrument.
</p>

<p>
Physical gestures of the performer can now effect the sound
</p>

<p>
Possibilities are endless for different kinds of music
</p>
</div>
</div>
<div id="outline-container-org5888a75" class="outline-3">
<h3 id="org5888a75">Music performance as shared human endeavor</h3>
<div class="outline-text-3" id="text-org5888a75">
<p>
Describes an electroacoustic music concert where the hall was darkened. Audience closed eyes or stared at the mixer LEDs. The audience became detached, isolated, and emotionally removed. When was the last standing ovation for electroacoustic music? It loses the aspect of the audience experiencing an event together, a shared cultural community.
</p>
</div>
</div>
<div id="outline-container-org11115b2" class="outline-3">
<h3 id="org11115b2">Uniting with the past</h3>
<div class="outline-text-3" id="text-org11115b2">
<p>
Just like opera in 1600 was a result of reawakened interest in the ancient world, interactive electroacoustic music takes advantage of the ideas and technology of today and unites them with the past.
</p>
</div>
</div>
<div id="outline-container-orga6175e9" class="outline-3">
<h3 id="orga6175e9">Human vs tech</h3>
<div class="outline-text-3" id="text-orga6175e9">
<p>
Instead of human vs tech where we know the tech is faster, louder, etc., use it without the dichotomy to join the power of the machine to the nuance and subjective control of the human performer.
</p>

<p>
Invent more human, more organic music instead of the sound of the machine. Instead of it being the inhuman other, let it be an extension to performance. 
</p>
</div>
</div>
<div id="outline-container-orgf8e6865" class="outline-3">
<h3 id="orgf8e6865">Ignore Tech</h3>
<div class="outline-text-3" id="text-orgf8e6865">
<p>
<code>One cannot turn one's back on the most significant technological breakthrough in history without risking irrelevance to that history. One cannot avoid taking advantage of the ubiquity of this technological marvel because that very ubiquity renders all other technologies in some sense less significant. One must take computers into account, and take them to task, because it is a response to the technology of our time, to the situation of our time. To make music with the technology of our time, and specifically the computer, poses a tremendous challenge for the artist. To address this challenge, in itself, will help keep music alive and significant.</code>
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p><a href="sitemap.html">Site Map</a></p>
</div>
</body>
</html>
